# Data wrangling

## 1-Imports

In [186]:
#Import pandas, matplotlib.pyplot, and seaborn 
import pandas as pd

## 2-Load the data

In [34]:
# Load The meal delivery company Data: Food Orders, Fulfilment center info, and meals info
orders = pd.read_csv('../Data/Food_orders_data.csv')
centers = pd.read_csv('../Data/fulfilment_center_info.csv')
meals= pd.read_csv('../Data/meal_info.csv')

## 3-Explore the data

In [56]:
#use the info method to see a summary of the data
orders.info()
centers.info()
meals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 456548 entries, 0 to 456547
Data columns (total 9 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   id                     456548 non-null  int64
 1   week                   456548 non-null  int64
 2   center_id              456548 non-null  int64
 3   meal_id                456548 non-null  int64
 4   checkout_price         456548 non-null  float64
 5   base_price             456548 non-null  float64
 6   emailer_for_promotion  456548 non-null  int64
 7   homepage_featured      456548 non-null  int64
 8   num_orders             456548 non-null  int64
dtypes: float64(2), int64(7)
memory usage: 31.3 MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   center_id    77 non-null     int64
 1   city_code    77 non-null     int64
 2   region_code  77 non-null     int64
 3   center_type  77 non-null     object
 4   op_area      77 non-null     float64
dtypes: float64(1), int64(3), object(1)
memory usage: 3.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   meal_id   51 non-null     int64
 1   category  51 non-null     object
 2   cuisine   51 non-null     object
dtypes: int64(1), object(2)
memory usage: 1.3+ KB

In [35]:
#use the head method to see the first several rows of the data
orders.head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders
0,1379560,1,55,1885,136.83,152.29,0,0,177
1,1466964,1,55,1993,136.83,135.83,0,0,270
2,1346989,1,55,2539,134.86,135.86,0,0,189
3,1338232,1,55,2139,339.50,437.53,0,0,54
4,1448490,1,55,2631,243.50,242.50,0,0,40

In [36]:
centers.head()

   center_id  city_code  region_code center_type  op_area
0         11        679           56      TYPE_A      3.7
1         13        590           56      TYPE_B      6.7
2        124        590           56      TYPE_C      4.0
3         66        648           34      TYPE_A      4.1
4         94        632           34      TYPE_C      3.6

In [37]:
meals.head()

   meal_id   category cuisine
0     1885  Beverages    Thai
1     1993  Beverages    Thai
2     2539  Beverages    Thai
3     1248  Beverages  Indian
4     2631  Beverages  Indian

In [178]:
#join all three tables
food_data=pd.merge(pd.merge(orders,centers, on='center_id'),meals, on='meal_id')
food_data.head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders,city_code,region_code,center_type,op_area,category,cuisine
0,1379560,1,55,1885,136.83,152.29,0,0,177,647,56,TYPE_C,2.0,Beverages,Thai
1,1018704,2,55,1885,135.83,152.29,0,0,323,647,56,TYPE_C,2.0,Beverages,Thai
2,1196273,3,55,1885,132.92,133.92,0,0,96,647,56,TYPE_C,2.0,Beverages,Thai
3,1116527,4,55,1885,135.86,134.86,0,0,163,647,56,TYPE_C,2.0,Beverages,Thai
4,1343872,5,55,1885,146.50,147.50,0,0,215,647,56,TYPE_C,2.0,Beverages,Thai

In [137]:
#change 'category' column name 
food_data.rename(columns={'category':'meal_category'},inplace=True)

In [138]:
food_data.head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders,city_code,region_code,center_type,op_area,meal_category,cuisine
0,1379560,1,55,1885,136.83,152.29,0,0,177,647,56,TYPE_C,2.0,Beverages,Thai
1,1018704,2,55,1885,135.83,152.29,0,0,323,647,56,TYPE_C,2.0,Beverages,Thai
2,1196273,3,55,1885,132.92,133.92,0,0,96,647,56,TYPE_C,2.0,Beverages,Thai
3,1116527,4,55,1885,135.86,134.86,0,0,163,647,56,TYPE_C,2.0,Beverages,Thai
4,1343872,5,55,1885,146.50,147.50,0,0,215,647,56,TYPE_C,2.0,Beverages,Thai

In [139]:
#use the info method to see a summary of the data
food_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 456548 entries, 0 to 456547
Data columns (total 15 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   id                     456548 non-null  int64
 1   week                   456548 non-null  int64
 2   center_id              456548 non-null  int64
 3   meal_id                456548 non-null  int64
 4   checkout_price         456548 non-null  float64
 5   base_price             456548 non-null  float64
 6   emailer_for_promotion  456548 non-null  int64
 7   homepage_featured      456548 non-null  int64
 8   num_orders             456548 non-null  int64
 9   city_code              456548 non-null  int64
 10  region_code            456548 non-null  int64
 11  center_type            456548 non-null  object
 12  op_area                456548 non-null  float64
 13  meal_category          456548 non-null  object
 14  cuisine                456548 non-null  object
dtypes: float64(3), int64(9), object(3)
memory usage: 52.2+ MB

The selected data types for the columns seem appropriate.

In [179]:
#Perform summary statistics on numeric features
food_data.describe()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders,city_code,region_code,op_area
count,4.565480e+05,456548.000000,456548.000000,456548.000000,456548.000000,456548.000000,456548.000000,456548.00000,456548.000000,456548.000000,456548.000000,456548.000000
mean,1.250096e+06,74.768771,82.105796,2024.337458,332.238933,354.156627,0.081152,0.10920,261.872760,601.553399,56.614566,4.083590
std,1.443548e+05,41.524956,45.975046,547.420920,152.939723,160.715914,0.273069,0.31189,395.922798,66.195914,17.641306,1.091686
min,1.000000e+06,1.000000,10.000000,1062.000000,2.970000,55.350000,0.000000,0.00000,13.000000,456.000000,23.000000,0.900000
25%,1.124999e+06,39.000000,43.000000,1558.000000,228.950000,243.500000,0.000000,0.00000,54.000000,553.000000,34.000000,3.600000
50%,1.250184e+06,76.000000,76.000000,1993.000000,296.820000,310.460000,0.000000,0.00000,136.000000,596.000000,56.000000,4.000000
75%,1.375140e+06,111.000000,110.000000,2539.000000,445.230000,458.870000,0.000000,0.00000,324.000000,651.000000,77.000000,4.500000
max,1.499999e+06,145.000000,186.000000,2956.000000,866.270000,866.270000,1.000000,1.00000,24299.000000,713.000000,93.000000,7.000000

We want to predict the total number of orders. So, the target variable is number of orders (num_orders)

### Check for missing data

In [141]:
# check if there is any missing values
food_data.isna().sum()

id                       0
week                     0
center_id                0
meal_id                  0
checkout_price           0
base_price               0
emailer_for_promotion    0
homepage_featured        0
num_orders               0
city_code                0
region_code              0
center_type              0
op_area                  0
meal_category            0
cuisine                  0
dtype: int64

There is no missing data.

#### Features unique values

In [142]:
city=food_data.city_code.unique().size
region=food_data.region_code.unique().size
centerType=food_data.center_type.unique().size
meal_cat=food_data.meal_category.unique().size
cuisine=food_data.cuisine.unique().size

print(f'city= {city}, region= {region}, center_Type= {centerType}, meal_cat= {meal_cat}, cuisine= {cuisine}')

city= 51, region= 8, center_Type= 3, meal_cat= 14, cuisine= 4

In [143]:
food_data.emailer_for_promotion.value_counts()

emailer_for_promotion
0    419498
1     37050
Name: count, dtype: int64

In [144]:
food_data.homepage_featured.value_counts()

homepage_featured
0    406693
1     49855
Name: count, dtype: int64

#### Checking the checkout price and base price to explore their relationship

In [145]:
checkout=len(food_data[food_data['checkout_price']>food_data['base_price']])
checkout

116101

In [146]:
base=len(food_data[food_data['checkout_price']<food_data['base_price']])
base

229687

In [147]:
check_base=len(food_data[food_data['checkout_price']==food_data['base_price']])
check_base

110760

#### Checking the email promotion and page featured and thier relationship

In [149]:
    (food_data[food_data.emailer_for_promotion!= food_data.homepage_featured]
 .groupby('emailer_for_promotion')['homepage_featured']
 .value_counts())

emailer_for_promotion  homepage_featured
0                      1                    30624
1                      0                    17819
Name: count, dtype: int64

In [150]:
    (food_data[food_data.emailer_for_promotion== food_data.homepage_featured]
 .groupby('emailer_for_promotion')['homepage_featured']
 .value_counts())

emailer_for_promotion  homepage_featured
0                      0                    388874
1                      1                     19231
Name: count, dtype: int64

### Explore total number of orders for some features

In [176]:
meal_data = food_data.groupby('meal_id')['num_orders'].sum().reset_index()
meal_data

    meal_id  num_orders
0      1062     4712795
1      1109     6367773
2      1198     1018280
3      1207     1800856
4      1216      533564
5      1230     1843969
6      1247      231897
7      1248      874750
8      1311     1489681
9      1438      395084
10     1445     1059221
11     1525     1719378
12     1543      791037
13     1558     1748940
14     1571      404932
15     1727     4735987
16     1754     6818059
17     1770      190709
18     1778     3308383
19     1803     1477018
20     1847      277635
21     1878     1542027
22     1885     8346246
23     1902      209242
24     1962     3235780
25     1971     5728620
26     1993     6656856
27     2104      159957
28     2126      597580
29     2139      380997
30     2290     9770303
31     2304      609378
32     2306      506600
33     2322     2298221
34     2444      942568
35     2490     3709125
36     2492      540339
37     2494      366927
38     2539     3234528
39     2569     3334399
40     2577     1021735
41     2581     2399000
42     2631     1090132
43     2640     2085360
44     2664     3900812
45     2704     1610896
46     2707     5932792
47     2760     1436019
48     2826     5090103
49     2867      713925
50     2956      307070

In [177]:
center_data = food_data.groupby('center_id')['num_orders'].sum().reset_index()
center_data

    center_id  num_orders
0          10     3381018
1          11     2797300
2          13     4296545
3          14     1195108
4          17     1218319
..        ...         ...
72        161      813948
73        162      680255
74        174     2792587
75        177     1021177
76        186      846982

[77 rows x 2 columns]

In [181]:
weekly_data=food_data.groupby('week')['num_orders'].sum().reset_index()
weekly_data

     week  num_orders
0       1      792261
1       2      787084
2       3      695262
3       4      743529
4       5     1198675
..    ...         ...
140   141      776240
141   142      739661
142   143      759926
143   144      801197
144   145      671926

[145 rows x 2 columns]

In [183]:
emailPromotion_data=food_data.groupby('emailer_for_promotion')['num_orders'].sum().reset_index()
emailPromotion_data

   emailer_for_promotion  num_orders
0                      0    96175321
1                      1    23382164

In [185]:
homepageFeatured_data=food_data.groupby('homepage_featured')['num_orders'].sum().reset_index()
homepageFeatured_data

   homepage_featured  num_orders
0                  0    89899504
1                  1    29657981

In [167]:
city_data = food_data.groupby('city_code')['num_orders'].sum().reset_index()
city_data

    city_code  num_orders
0         456     1937221
1         461     1158164
2         473     1214982
3         478      637527
4         485     1451046
5         515      894009
6         517     3205569
7         522     3375905
8         526     9207953
9         541      768013
10        553      999063
11        556     1404232
12        561     1028714
13        562     1070338
14        576     2291621
15        577     1863012
16        579     2264042
17        590    19849062
18        593     2052003
19        596     2103282
20        599     1659568
21        602     1863630
22        604     3533367
23        609     1366290
24        614     3166274
25        615     1178897
26        620     1467295
27        628     1833427
28        632      939053
29        638     6662450
30        647     3268788
31        648     1669741
32        649      846982
33        651     1739081
34        654     1195108
35        658      813948
36        659     1628964
37        675     1349175
38        676     1989421
39        679     2797300
40        680     1325039
41        683     1021177
42        685     3125835
43        693      743148
44        695     1015920
45        698     1609906
46        699     3221414
47        700     2792587
48        702      691044
49        703     1969200
50        713     2297698

In [168]:
region_data = food_data.groupby('region_code')['num_orders'].sum().reset_index()
region_data

   region_code  num_orders
0           23     1609906
1           34    24051733
2           35      691044
3           56    60520191
4           71     2103282
5           77    20529653
6           85     8685386
7           93     1366290

In [169]:
centerType_data = food_data.groupby('center_type')['num_orders'].sum().reset_index()
centerType_data

  center_type  num_orders
0      TYPE_A    68978517
1      TYPE_B    29996073
2      TYPE_C    20582895

In [171]:
mealCat_data = food_data.groupby('meal_category')['num_orders'].sum().reset_index()
mealCat_data

   meal_category  num_orders
0      Beverages    40480525
1        Biryani      631848
2         Desert     1940754
3         Extras     3984979
4           Fish      871959
5   Other Snacks     4766293
6          Pasta     1637744
7          Pizza     7383720
8      Rice Bowl    20874063
9          Salad    10944336
10      Sandwich    17636782
11       Seafood     2715714
12          Soup     1039646
13      Starters     4649122

In [173]:
cuisine_data = food_data.groupby('cuisine')['num_orders'].sum().reset_index()
cuisine_data

       cuisine  num_orders
0  Continental    16914439
1       Indian    25792544
2      Italian    44172832
3         Thai    32677670